# FilteredWorksetIdIterator Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredWorksetIdIterator Methods
FilteredWorksetIdIterator Class See Also
---
The FilteredWorksetIdIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurrent | The current workset id found by the iterator. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next workset id passing the filter. |
| Reset | Resets the iterator to the beginning. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace